//=============================================================================
//
// テクスチャ処理 [texture.cpp]
// Author : TANEKAWA RIKU
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "texture.h"
#include "renderer.h"
#include "manager.h"

//*****************************************************************************
// 静的メンバ変数宣言
//*****************************************************************************
int CTexture::m_nNumAll = 0;

//=============================================================================
// コンストラクタ
//=============================================================================
CTexture::CTexture()
{
	// 値のクリア
	for (int nCnt = 0; nCnt < MAX_TEXTURE; nCnt++)
	{
		m_apTexture[nCnt] = {};
	}
}
//=============================================================================
// デストラクタ
//=============================================================================
CTexture::~CTexture()
{
	// なし
}
//=============================================================================
// テクスチャの読み込み
//=============================================================================
HRESULT CTexture::Load(void)
{
	// デバイスの取得
	CRenderer* renderer = CManager::GetRenderer();
	LPDIRECT3DDEVICE9 pDevice = renderer->GetDevice();

	// 全てのテクスチャの読み込み
	for (int nCnt = 0; nCnt < MAX_TEXTURE; nCnt++)
	{
		D3DXCreateTextureFromFile(pDevice,
			TEXTURE[nCnt],
			&m_apTexture[nCnt]);
	}

	return S_OK;
}
//=============================================================================
// テクスチャの破棄
//=============================================================================
void CTexture::Unload(void)
{
	// 全てのテクスチャの破棄
	for (int nCnt = 0; nCnt < MAX_TEXTURE; nCnt++)
	{
		if (m_apTexture[nCnt] != NULL)
		{
			m_apTexture[nCnt]->Release();
			m_apTexture[nCnt] = NULL;
		}
	}
}
//=============================================================================
// テクスチャの指定
//=============================================================================
int CTexture::Register(const char* pFilename)
{
	int nIdx = -1;

	nIdx++;
	
	for (int nCnt = 0; nCnt < MAX_TEXTURE; nCnt++)
	{
		if (TEXTURE[nCnt] != NULL)
		{
			if (strcmp(pFilename, TEXTURE[nCnt]) == 0)
			{
				nIdx = nCnt;
				break;
			}
		}
	}

	return nIdx;
}
//=============================================================================
// Xファイル用テクスチャの指定
//=============================================================================
int CTexture::RegisterX(const char* pFilename)
{
	for (int nCnt = 0; nCnt < MAX_TEXTURE; nCnt++)
	{
		if (TEXTURE[nCnt] != NULL)
		{
			if (strcmp(pFilename, TEXTURE[nCnt]) == 0)
			{
				return nCnt;
			}
		}
	}

	return -1; // 見つからなかった
}
//=============================================================================
// テクスチャのアドレス取得
//=============================================================================
LPDIRECT3DTEXTURE9 CTexture::GetAddress(int nIdx)
{
	if (nIdx < 0 || nIdx >= MAX_TEXTURE)
	{// 範囲外
		return NULL;
	}

	return m_apTexture[nIdx];
}