//=============================================================================
//
// UI処理 [ui.cpp]
// Author : RIKU TANEKAWA
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "ui.h"
#include "manager.h"
#include "result.h"
#include "game.h"


//*****************************************************************************
// 静的メンバ変数宣言
//*****************************************************************************
std::unordered_map<CUi::TYPE, UiCreateFunc> CUi::m_UiFactoryMap = {};

//=============================================================================
// コンストラクタ
//=============================================================================
CUi::CUi(int nPriority) : CObject2D(nPriority)
{
	// 値のクリア
	m_nIdxTexture = 0;
	memset(m_szPath, 0, sizeof(m_szPath));
	m_type = TYPE_PAUSE;
	m_uvLeft = 0.0f;
	m_uvTop = 0.0f;
	m_uvWidth = 0.0f;
	m_uvHeight = 0.0f;
	m_isUVDirty = false;
}
//=============================================================================
// デストラクタ
//=============================================================================
CUi::~CUi()
{
	// なし
}
//=============================================================================
// 生成処理
//=============================================================================
CUi* CUi::Create(TYPE type, const char* path,D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	if (m_UiFactoryMap.empty())
	{
		// ファクトリー
		InitFactory();
	}

	CUi* pUi = nullptr;

	auto it = m_UiFactoryMap.find(type);
	if (it != m_UiFactoryMap.end())
	{
		pUi = it->second();
	}
	else
	{
		pUi = new CUi(); // デフォルト基底クラス
	}

	if (!pUi)
	{
		return NULL;
	}

	pUi->SetPath(path);
	pUi->SetPos(pos);
	pUi->SetCol(D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f));
	pUi->SetSize(fWidth,fHeight);

	// 初期化処理
	pUi->Init();

	return pUi;
}
//=============================================================================
// ファクトリー
//=============================================================================
void CUi::InitFactory(void)
{
	// リストを空にする
	m_UiFactoryMap.clear();

	m_UiFactoryMap[CUi::TYPE_PAUSE]				= []() -> CUi* { return new CPauseUi(); };
	m_UiFactoryMap[CUi::TYPE_GET]				= []() -> CUi* { return new CGetUi(); };
	m_UiFactoryMap[CUi::TYPE_RESULT_UI]			= []() -> CUi* { return new CResultUi(); };
	m_UiFactoryMap[CUi::TYPE_RESULT_TREASURE]	= []() -> CUi* { return new CResultTreasureUi(); };
	m_UiFactoryMap[CUi::TYPE_RESULT_RANK]		= []() -> CUi* { return new CResultRankUi(); };
	m_UiFactoryMap[CUi::TYPE_RESULT_GET]		= []() -> CUi* { return new CResultGetUi(); };
	m_UiFactoryMap[CUi::TYPE_STAGE_NAME]		= []() -> CUi* { return new CStageUi(); };
	m_UiFactoryMap[CUi::TYPE_INTERACT]			= []() -> CUi* { return new CInteractUi(); };
}
//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CUi::Init(void)
{
	// デバイスの取得
	LPDIRECT3DDEVICE9 pDevice = CManager::GetRenderer()->GetDevice();

	// テクスチャの取得
	m_nIdxTexture = CManager::GetTexture()->Register(m_szPath);

	// 2Dオブジェクトの初期化処理
	CObject2D::Init();

	return S_OK;
}
//=============================================================================
// 終了処理
//=============================================================================
void CUi::Uninit(void)
{
	// サウンドの停止
	CManager::GetSound()->Stop();

	// 2Dオブジェクトの終了処理
	CObject2D::Uninit();
}
//=============================================================================
// 更新処理
//=============================================================================
void CUi::Update(void)
{
	// 2Dオブジェクトの更新処理
	CObject2D::Update();

	if (m_isUVDirty)
	{
		// テクスチャUV移動処理
		CObject2D::MoveTexUV(m_uvLeft, m_uvTop, m_uvWidth, m_uvHeight);

		m_isUVDirty = false;
	}

}
//=============================================================================
// 描画処理
//=============================================================================
void CUi::Draw(void)
{
	// デバイスの取得
	LPDIRECT3DDEVICE9 pDevice = CManager::GetRenderer()->GetDevice();

	// テクスチャの設定
	pDevice->SetTexture(0, CManager::GetTexture()->GetAddress(m_nIdxTexture));

	// 2Dオブジェクトの描画処理
	CObject2D::Draw();
}
//=============================================================================
// UVの設定処理
//=============================================================================
void CUi::SetUV(float u, float v, float w, float h)
{
	m_uvLeft = u;
	m_uvTop = v;
	m_uvWidth = w;
	m_uvHeight = h;
	m_isUVDirty = true;
}


//=============================================================================
// ポーズUIのコンストラクタ
//=============================================================================
CPauseUi::CPauseUi()
{
	// 値のクリア
}
//=============================================================================
// ポーズUIのデストラクタ
//=============================================================================
CPauseUi::~CPauseUi()
{
	// なし
}
//=============================================================================
// ポーズUIの初期化処理
//=============================================================================
HRESULT CPauseUi::Init(void)
{
	// UIの初期化処理
	CUi::Init();

	return S_OK;
}
//=============================================================================
// ポーズUIの更新処理
//=============================================================================
void CPauseUi::Update(void)
{
	// UIの更新処理
	CUi::Update();
}


//=============================================================================
// 秘宝取得UIのコンストラクタ
//=============================================================================
CGetUi::CGetUi()
{
	// 値のクリア
	m_fTimer = 0.0f;// 経過時間(秒)
	m_fAlpha = 1.0f;// アルファ値
	m_bFading = false;// フェード開始フラグ
	m_isGet = false;// サウンド用フラグ
}
//=============================================================================
// 秘宝取得UIのデストラクタ
//=============================================================================
CGetUi::~CGetUi()
{
	// なし
}
//=============================================================================
// 秘宝取得UIの初期化処理
//=============================================================================
HRESULT CGetUi::Init(void)
{
	// UIの初期化処理
	CUi::Init();

	return S_OK;
}
//=============================================================================
// 秘宝取得UIの更新処理
//=============================================================================
void CGetUi::Update(void)
{
	// UIの更新処理
	CUi::Update();

	// 時間経過
	m_fTimer++; // 毎フレームの経過時間を加算

	// 3秒経過でフェード開始
	if (m_fTimer >= 180.0f)
	{
		m_bFading = true;
	}

	// フェード処理（毎フレーム少しずつ減らす）
	if (m_bFading)
	{
		m_fAlpha -= 0.008f; // 1秒でアルファ0になる速さ

		if (m_fAlpha < 0.0f)
		{
			m_fAlpha = 0.0f;
		}
	}

	if (!m_isGet)
	{
		// 入手サウンドの再生
		CManager::GetSound()->Play(CSound::SOUND_LABEL_GET);

		m_isGet = true;
	}

	// 色の設定
	SetCol(D3DXCOLOR(1.0f, 1.0f, 1.0f, m_fAlpha));
}


//=============================================================================
// リザルトUIのコンストラクタ
//=============================================================================
CResultUi::CResultUi()
{
	// 値のクリア
}
//=============================================================================
// リザルトUIのデストラクタ
//=============================================================================
CResultUi::~CResultUi()
{
	// なし
}
//=============================================================================
// リザルトUIの初期化処理
//=============================================================================
HRESULT CResultUi::Init(void)
{
	// UIの初期化処理
	CUi::Init();

	return S_OK;
}
//=============================================================================
// リザルトUIの更新処理
//=============================================================================
void CResultUi::Update(void)
{
	// UIの更新処理
	CUi::Update();
}


//=============================================================================
// リザルトUI(秘宝)のコンストラクタ
//=============================================================================
CResultTreasureUi::CResultTreasureUi()
{
	// 値のクリア
	m_showDeleyTime = 0;	// 表示までの遅延時間
	m_fAlpha = 0.0f;			// アルファ値
	m_isShow = false;
	m_prevShow = false;
}
//=============================================================================
// リザルトUI(秘宝)のデストラクタ
//=============================================================================
CResultTreasureUi::~CResultTreasureUi()
{
	// なし
}
//=============================================================================
// リザルトUI(秘宝)の初期化処理
//=============================================================================
HRESULT CResultTreasureUi::Init(void)
{
	// UIの初期化処理
	CUi::Init();

	// 表示遅延時間の設定(秒)
	SetDeleyTime(2);

	return S_OK;
}
//=============================================================================
// リザルトUI(秘宝)の更新処理
//=============================================================================
void CResultTreasureUi::Update(void)
{
	m_showDeleyTime--;

	if (m_showDeleyTime <= 0)
	{
		m_isShow = true;
		m_fAlpha += 0.01f;

		if (m_fAlpha > 1.0f)
		{
			m_fAlpha = 1.0f;
		}

		// 通常に戻す
		SetCol(D3DXCOLOR(1.0f, 1.0f, 1.0f, m_fAlpha));

		bool n = m_isShow;

		if (n && !m_prevShow)
		{// 一回だけ通す
			// ランク表示サウンドの再生
			CManager::GetSound()->Play(CSound::SOUND_LABEL_RANK);
		}

		m_prevShow = n;
	}
	else
	{
		// 透明にする
		SetCol(D3DXCOLOR(1.0f, 1.0f, 1.0f, 0.0f));
	}

	// UIの更新処理
	CUi::Update();
}


//=============================================================================
// リザルトUI(ランク)のコンストラクタ
//=============================================================================
CResultRankUi::CResultRankUi()
{
	// 値のクリア
	m_showDeleyTime = 0;
	m_fAlpha = 0.0f;
	m_isShow = false;
	m_prevShow = false;
}
//=============================================================================
// リザルトUI(ランク)のデストラクタ
//=============================================================================
CResultRankUi::~CResultRankUi()
{
	// なし
}
//=============================================================================
// リザルトUI(ランク)の初期化処理
//=============================================================================
HRESULT CResultRankUi::Init(void)
{
	// UIの初期化処理
	CUi::Init();

	// 表示遅延時間の設定(秒)
	SetDeleyTime(5);

	int min = CResult::GetClearMinutes();
	int sec = CResult::GetClearSeconds();
	float totalSec = min * 60.0f + sec;

	float uvLeft = 0.0f;

	if (totalSec < 300.0f)
	{// 5分未満
		uvLeft = 0.0f;   // S
	}
	else if (totalSec < 360.0f)
	{// 6分未満
		uvLeft = 0.25f;  // A
	}
	else if (totalSec < 420.0f)
	{// 7分未満
		uvLeft = 0.5f;   // B
	}
	else
	{// それ以降
		uvLeft = 0.75f;  // C
	}

	// UV座標の設定
	CUi::SetUV(uvLeft, 0.0f, 0.25f, 1.0f);  // 横4分割、縦1

	return S_OK;
}
//=============================================================================
// リザルトUI(ランク)の更新処理
//=============================================================================
void CResultRankUi::Update(void)
{
	m_showDeleyTime--;

	if (m_showDeleyTime <= 0)
	{
		m_isShow = true;
		m_fAlpha += 0.01f;

		if (m_fAlpha > 1.0f)
		{
			m_fAlpha = 1.0f;
		}

		// 通常に戻す
		SetCol(D3DXCOLOR(1.0f, 1.0f, 1.0f, m_fAlpha));

		bool n = m_isShow;

		if (n && !m_prevShow)
		{// 一回だけ通す
			// ランク表示サウンドの再生
			CManager::GetSound()->Play(CSound::SOUND_LABEL_RANK);
		}

		m_prevShow = n;
	}
	else
	{
		// 透明にする
		SetCol(D3DXCOLOR(1.0f, 1.0f, 1.0f, 0.0f));
	}

	// UIの更新処理
	CUi::Update();
}


//=============================================================================
// リザルトUI(入手したか)のコンストラクタ
//=============================================================================
CResultGetUi::CResultGetUi()
{
	// 値のクリア
	m_showDeleyTime = 0;	// 表示までの遅延時間
	m_isShow = false;
	m_prevShow = false;
}
//=============================================================================
// リザルトUI(入手したか)のデストラクタ
//=============================================================================
CResultGetUi::~CResultGetUi()
{
	// なし
}
//=============================================================================
// リザルトUI(入手したか)の初期化処理
//=============================================================================
HRESULT CResultGetUi::Init(void)
{
	// UIの初期化処理
	CUi::Init();

	// 表示遅延時間の設定(秒)
	SetDeleyTime(3);

	return S_OK;
}
//=============================================================================
// リザルトUI(入手したか)の更新処理
//=============================================================================
void CResultGetUi::Update(void)
{
	m_showDeleyTime--;

	if (m_showDeleyTime <= 0)
	{
		m_isShow = true;

		// 通常に戻す
		SetCol(D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f));

		bool n = m_isShow;

		if (n && !m_prevShow)
		{// 一回だけ通す
			// ランク表示サウンドの再生
			CManager::GetSound()->Play(CSound::SOUND_LABEL_RANK);
		}

		m_prevShow = n;
	}
	else
	{
		// 透明にする
		SetCol(D3DXCOLOR(1.0f, 1.0f, 1.0f, 0.0f));
	}

	// UIの更新処理
	CUi::Update();
}


//=============================================================================
// ステージ名表示のコンストラクタ
//=============================================================================
CStageUi::CStageUi()
{
	// 値のクリア
	m_fTimer = 0.0f;// 経過時間(秒)
	m_fAlpha = 0.0f;// アルファ値
	m_state = STATE_FADEIN; // 状態
}
//=============================================================================
// ステージ名表示のデストラクタ
//=============================================================================
CStageUi::~CStageUi()
{
	// なし
}
//=============================================================================
// ステージ名表示の初期化処理
//=============================================================================
HRESULT CStageUi::Init(void)
{
	// UIの初期化処理
	CUi::Init();

	return S_OK;
}
//=============================================================================
// ステージ名表示の更新処理
//=============================================================================
void CStageUi::Update(void)
{
	// UIの更新処理
	CUi::Update();

	// 時間経過
	m_fTimer++; // 毎フレームの経過時間を加算

	switch (m_state)
	{
	case STATE_FADEIN:
		m_fAlpha += 0.005f; // 1秒でアルファ0になる速さ

		if (m_fAlpha >= 1.0f)
		{
			m_fAlpha = 1.0f;
			m_fTimer = 0.0f;
			m_state = STATE_SHOW;
		}
		break;
	case STATE_SHOW:
		// 一定時間表示
		if (m_fTimer >= 180.0f)
		{
			m_state = STATE_FADEOUT;
		}
		break;
	case STATE_FADEOUT:
		m_fAlpha -= 0.005f; // 1秒でアルファ0になる速さ

		if (m_fAlpha <= 0.0f)
		{
			m_fAlpha = 0.0f;
			m_state = STATE_END;
		}
	case STATE_END:
		// 何もしない
		break;
	}

	SetCol(D3DXCOLOR(1.0f, 1.0f, 1.0f, m_fAlpha));
}


//=============================================================================
// インタラクトUIのコンストラクタ
//=============================================================================
CInteractUi::CInteractUi()
{
	// 値のクリア
	m_isInteract = false;
}
//=============================================================================
// インタラクトUIのデストラクタ
//=============================================================================
CInteractUi::~CInteractUi()
{
	// なし
}
//=============================================================================
// インタラクトUIの初期化処理
//=============================================================================
HRESULT CInteractUi::Init(void)
{
	// UIの初期化処理
	CUi::Init();

	return S_OK;
}
//=============================================================================
// インタラクトUIの更新処理
//=============================================================================
void CInteractUi::Update(void)
{
	// UIの更新処理
	CUi::Update();

	CInputMouse* pMouse = CManager::GetInputMouse();
	CInputJoypad* pJoypad = CManager::GetInputJoypad();

	D3DXVECTOR3 playerPos = CGame::GetPlayer()->GetPos();
	D3DXVECTOR3 HintTextPos = CGame::GetHintText()->GetPos();

	D3DXVECTOR3 disPos = playerPos - HintTextPos;

	float distance = D3DXVec3Length(&disPos);

	const float kTriggerDistance = 180.0f; // 反応距離

	if (distance < kTriggerDistance)
	{
		if (CManager::GetInputMouse()->GetTrigger(0) || CManager::GetInputJoypad()->GetTriggerR2())
		{
			m_isInteract = true;
		}

		// 通常に戻す
		SetCol(D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f));
	}
	else
	{
		// 透明にする
		SetCol(D3DXCOLOR(1.0f, 1.0f, 1.0f, 0.0f));
	}
}
